## [staging](https://jace-ys.app.spacelift.io/stack/staging/run/01HV175P9HBQ1D6CC6TB4DJ5GX) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HV1181NBDP6938KZ6R1NAXS8] Planning changes with 0 custom hooks...
data.google_client_config.default: Reading...
data.google_project.this: Reading...
data.google_client_config.default: Read complete after 0s [id=projects/"emp-jace-a850"/regions/"europe-west1"/zones/<null>]
data.google_project.this: Read complete after 0s [id=projects/emp-jace-a850]
data.google_container_cluster.operator: Reading...
data.google_container_cluster.operator: Read complete after 1s [id=projects/emp-jace-a850/locations/europe-west1/clusters/jace-operator-europe-west1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_secret_manager_secret_version.tailscale_operator will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_secret_manager_secret_version" "tailscale_operator" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "emp-jace-a850"
      + secret       = "tailscale_operator_staging"
      + secret_data  = (sensitive value)
      + version      = "1"
    }

  # google_secret_manager_secret.tailscale_operator will be created
  + resource "google_secret_manager_secret" "tailscale_operator" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "emp-jace-a850"
      + secret_id             = "tailscale_operator_staging"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

  # kubernetes_secret.cluster_operator will be created
  + resource "kubernetes_secret" "cluster_operator" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "argocd.argoproj.io/secret-type" = "cluster"
              + "example.com/apps-cluster"       = "true"
            }
          + name             = "staging-operator"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_secret.operator_oauth will be created
  + resource "kubernetes_secret" "operator_oauth" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "operator-oauth"
          + namespace        = "tailscale-operator"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.cluster.google_compute_network.cluster will be created
  + resource "google_compute_network" "cluster" {
      + auto_create_subnetworks                   = false
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "jace-staging-europe-west1"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + numeric_id                                = (known after apply)
      + project                                   = "emp-jace-a850"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.cluster.google_compute_router.cluster will be created
  + resource "google_compute_router" "cluster" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "jace-staging-europe-west1"
      + network            = "jace-staging-europe-west1"
      + project            = "emp-jace-a850"
      + region             = "europe-west1"
      + self_link          = (known after apply)
    }

  # module.cluster.google_compute_router_nat.cluster will be created
  + resource "google_compute_router_nat" "cluster" {
      + enable_dynamic_port_allocation      = (known after apply)
      + enable_endpoint_independent_mapping = (known after apply)
      + icmp_idle_timeout_sec               = 30
      + id                                  = (known after apply)
      + min_ports_per_vm                    = (known after apply)
      + name                                = "jace-staging-europe-west1"
      + nat_ip_allocate_option              = "AUTO_ONLY"
      + project                             = "emp-jace-a850"
      + region                              = "europe-west1"
      + router                              = "jace-staging-europe-west1"
      + source_subnetwork_ip_ranges_to_nat  = "LIST_OF_SUBNETWORKS"
      + tcp_established_idle_timeout_sec    = 1200
      + tcp_time_wait_timeout_sec           = 120
      + tcp_transitory_idle_timeout_sec     = 30
      + udp_idle_timeout_sec                = 30

      + log_config {
          + enable = false
          + filter = "ALL"
        }

      + subnetwork {
          + name                     = (known after apply)
          + secondary_ip_range_names = []
          + source_ip_ranges_to_nat  = [
              + "ALL_IP_RANGES",
            ]
        }
    }

  # module.cluster.google_compute_subnetwork.cluster will be created
  + resource "google_compute_subnetwork" "cluster" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.16.0.0/22"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "jace-staging-europe-west1"
      + network                    = "jace-staging-europe-west1"
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "emp-jace-a850"
      + purpose                    = (known after apply)
      + region                     = "europe-west1"
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)

      + log_config {
          + aggregation_interval = "INTERVAL_5_SEC"
          + filter_expr          = "true"
          + flow_sampling        = 0.5
          + metadata             = "INCLUDE_ALL_METADATA"
        }
    }

  # module.cluster.google_container_cluster.cluster will be created
  + resource "google_container_cluster" "cluster" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = "ADVANCED_DATAPATH"
      + default_max_pods_per_node   = (known after apply)
      + deletion_protection         = true
      + enable_fqdn_network_policy  = true
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_multi_networking     = false
      + enable_shielded_nodes       = true
      + enable_tpu                  = (known after apply)
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "europe-west1"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "jace-staging-europe-west1"
      + network                     = "jace-staging-europe-west1"
      + networking_mode             = "VPC_NATIVE"
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "emp-jace-a850"
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = "jace-staging-europe-west1"
      + tpu_ipv4_cidr_block         = (known after apply)

      + addons_config {
          + config_connector_config {
              + enabled = true
            }
          + dns_cache_config {
              + enabled = true
            }
        }

      + authenticator_groups_config {
          + security_group = "gke-security-groups@duffel.com"
        }

      + cost_management_config {
          + enabled = true
        }

      + database_encryption {
          + key_name = "projects/emp-jace-a850/locations/europe-west1/keyRings/jace-staging-europe-west1-keyring/cryptoKeys/jace-staging-europe-west1-encryption-key"
          + state    = "ENCRYPTED"
        }

      + dns_config {
          + cluster_dns        = "CLOUD_DNS"
          + cluster_dns_domain = "cluster.staging"
          + cluster_dns_scope  = "VPC_SCOPE"
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = "10.40.0.0/16"
          + cluster_secondary_range_name  = (known after apply)
          + services_ipv4_cidr_block      = "10.28.0.0/18"
          + services_secondary_range_name = (known after apply)
          + stack_type                    = "IPV4"
        }

      + logging_config {
          + enable_components = [
              + "SYSTEM_COMPONENTS",
              + "SCHEDULER",
              + "WORKLOADS",
            ]
        }

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "03:00"
            }
        }

      + monitoring_config {
          + enable_components = [
              + "SYSTEM_COMPONENTS",
              + "APISERVER",
              + "SCHEDULER",
              + "CONTROLLER_MANAGER",
            ]

          + advanced_datapath_observability_config {
              + enable_metrics = false
              + enable_relay   = false
              + relay_mode     = (known after apply)
            }

          + managed_prometheus {
              + enabled = false
            }
        }

      + private_cluster_config {
          + enable_private_nodes   = true
          + master_ipv4_cidr_block = "172.18.0.0/28"
          + peering_name           = (known after apply)
          + private_endpoint       = (known after apply)
          + public_endpoint        = (known after apply)
        }

      + release_channel {
          + channel = "REGULAR"
        }

      + security_posture_config {
          + mode               = "BASIC"
          + vulnerability_mode = "VULNERABILITY_BASIC"
        }

      + workload_identity_config {
          + workload_pool = "emp-jace-a850.svc.id.goog"
        }
    }

  # module.cluster.google_container_node_pool.node_pool["default-1"] will be created
  + resource "google_container_node_pool" "node_pool" {
      + cluster                     = "jace-staging-europe-west1"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "europe-west1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "default-1-europe-west1"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "emp-jace-a850"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 1
          + min_node_count  = 1
        }

      + node_config {
          + disk_size_gb      = 50
          + disk_type         = (known after apply)
          + effective_taints  = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = "COS_CONTAINERD"
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = (known after apply)
          + machine_type      = "c3d-standard-4"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = false
          + service_account   = (known after apply)
          + spot              = false

          + shielded_instance_config {
              + enable_integrity_monitoring = true
              + enable_secure_boot          = true
            }
        }

      + upgrade_settings {
          + max_surge       = 3
          + max_unavailable = 1
          + strategy        = "SURGE"
        }
    }

  # module.cluster.google_kms_crypto_key.application_layer_secrets_encryption_key will be created
  + resource "google_kms_crypto_key" "application_layer_secrets_encryption_key" {
      + destroy_scheduled_duration = (known after apply)
      + effective_labels           = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                         = (known after apply)
      + import_only                = (known after apply)
      + key_ring                   = (known after apply)
      + name                       = "jace-staging-europe-west1-encryption-key"
      + primary                    = (known after apply)
      + purpose                    = "ENCRYPT_DECRYPT"
      + rotation_period            = "2592000s"
      + terraform_labels           = {
          + "goog-terraform-provisioned" = "true"
        }

      + version_template {
          + algorithm        = "GOOGLE_SYMMETRIC_ENCRYPTION"
          + protection_level = "SOFTWARE"
        }
    }

  # module.cluster.google_kms_key_ring.keyring will be created
  + resource "google_kms_key_ring" "keyring" {
      + id       = (known after apply)
      + location = "europe-west1"
      + name     = "jace-staging-europe-west1-keyring"
      + project  = "emp-jace-a850"
    }

  # module.cluster.google_project_iam_member.application_layer_secrets_encryption will be created
  + resource "google_project_iam_member" "application_layer_secrets_encryption" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:service-639381616334@container-engine-robot.iam.gserviceaccount.com"
      + project = "emp-jace-a850"
      + role    = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.cluster.google_project_iam_member.cluster_nodes_gke_node_service_account will be created
  + resource "google_project_iam_member" "cluster_nodes_gke_node_service_account" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "emp-jace-a850"
      + role    = "roles/container.nodeServiceAccount"
    }

  # module.cluster.google_service_account.cluster_nodes will be created
  + resource "google_service_account" "cluster_nodes" {
      + account_id   = "staging-cluster-nodes"
      + disabled     = false
      + display_name = "Cluster Nodes Service Account [staging]"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "emp-jace-a850"
      + unique_id    = (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - example = "Hello!" -> null
[01HV1181NBDP6938KZ6R1NAXS8] Changes are GO
[01HV1181NBDP6938KZ6R1NAXS8] Uploading the list of managed resources...
[01HV1181NBDP6938KZ6R1NAXS8] Please be aware that the run changes calculation includes output changes.
[01HV1181NBDP6938KZ6R1NAXS8] Resource list upload is GO
[01HV1181NBDP6938KZ6R1NAXS8] Generating JSON representation of the plan...
[01HV1181NBDP6938KZ6R1NAXS8] JSON representation is GO
[01HV1181NBDP6938KZ6R1NAXS8] Loading custom plan policy inputs...
[01HV1181NBDP6938KZ6R1NAXS8] 0 custom plan policy inputs found
[01HV1181NBDP6938KZ6R1NAXS8] No plan policies to evaluate
```

</details>